Documents/ЗаявкаНаКонтрольКачестваТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаКонтрольКачестваТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаСклад</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровОтХранителя</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПриемкаТоваровНаХранение</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьРазблокировкуТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодтвержденияКачества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтролируемаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КачествоПодтверждено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КонтролируемыеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтролируемыеПартии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПартияКонтроляКачества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаБлокировкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныБлокировкиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьРазблокировкуТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодтвержденияКачества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделениеОбработано</Name>
					<Comment>Служебный реквизит для обработчика обновления по заполнению подразделения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЗаявкаНаКонтрольКачестваТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(
		ЭтотОбъект,
		МассивНепроверяемыхРеквизитов,
		Отказ);
		
	НоменклатураСервер.ПроверитьЗаполнениеСерий(
		ЭтотОбъект,
		НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаявкаНаКонтрольКачестваТоваров),
		Отказ,
		МассивНепроверяемыхРеквизитов);
		
	СкладыСервер.ПроверитьЗаполнениеПомещений(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	СкладыСервер.ПроверитьЗаполнениеЯчеек(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ПроверитьКомплектностьТоварныхМест = Истина;
	ПараметрыПроверки.ПоляГруппировкиПроверкиКомплектности = "КонтролируемаяПартия,КачествоПодтверждено,Назначение,Склад,Помещение";
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	// Проверка заполнения упаковок номенклатуры на адресных складах
	ВыборкаСкладПомещение = КонтрольКачества.ВыборкаСкладПомещение(Товары.Выгрузить(,"Склад,Помещение"), Дата);
	Пока ВыборкаСкладПомещение.Следующий() Цикл
		ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияУпаковок();
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Склад", ВыборкаСкладПомещение.Склад);
		ПараметрыПроверки.ОтборПроверяемыхСтрок.Вставить("Помещение", ВыборкаСкладПомещение.Помещение);
		НоменклатураСервер.ПроверитьЗаполнениеУпаковок(
			ЭтотОбъект,
			МассивНепроверяемыхРеквизитов,
			Отказ,
			ПараметрыПроверки);
	КонецЦикла;
	
	Если МассивНепроверяемыхРеквизитов.Найти("Товары.Упаковка") = Неопределено Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Упаковка");
	КонецЕсли;
	
	Если Не ПланироватьРазблокировкуТоваров Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПодтвержденияКачества");
	КонецЕсли;
	
	Если ПричинаБлокировкиТовара <> Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КонтролируемаяПартия");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	// Механизм "Контролируемые партии".
	// Заявка всегда делает движения по Товары на складах, поэтому партия нужна всегда.
	КлючевыеРеквизиты = КонтрольКачества.РеквизитыОпределенияНеобходимостиПартииВДокументе(Неопределено, Неопределено);
	КонтрольКачества.ЗаполнитьКонтролируемуюПартиюПередЗаписьюДокумента(ЭтотОбъект, КлючевыеРеквизиты);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	// Механизм "Контролируемые партии".
	КонтрольКачества.СоздатьОбновитьКонтролируемуюПартиюПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	КонтролируемаяПартия = Справочники.КонтролируемыеПартии.ПустаяСсылка();
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровОтХранителя") Тогда
		ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаТоваров") Тогда
		ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда
		ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения);
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьНаОснованииПриобретенияТоваровУслуг(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровНаСклад(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПоступленияТоваровОтХранителя(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСборкиТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры
Процедура ЗаполнитьНаОснованииПриемкиТоваровНаХранение(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииПрочегоОприходованияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры


Процедура ЗаполнитьНаОснованииПеремещенияТоваров(ДанныеЗаполнения)
	
	Аналитики = КонтрольКачества.АналитикиПоступившегоТовара(ДанныеЗаполнения);
	ТаблицаДанных = КонтрольКачества.ОстаткиПоАналитикам(Аналитики, Истина, Неопределено);
	Если ТаблицаДанных.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'По документу %1 нет остатков поступивших товаров к оформлению заявок на контроль качества товаров. Заполнение невозможно.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, ДанныеЗаполнения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Товары.Загрузить(ТаблицаДанных);
	ПричинаБлокировкиТовара = Справочники.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара;
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
	ДокументОснование = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	ПланироватьРазблокировкуТоваров = Истина;
	Если Товары.Количество() = 0 Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	Иначе
		КонтрольКачества.ЗаполнитьОчиститьСкладПомещениеПоДаннымТабличнойЧастиДокумента(ЭтотОбъект);
	КонецЕсли;
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Ответственный, Подразделение);
	Автор = Пользователи.ТекущийПользователь();
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Товары.Количество() > 0 Тогда
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаявкаНаКонтрольКачестваТоваров);
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
